Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Specify the word RAW (case-insensitive) to write the exact bytes contained by Text to the file as-is, without any conversion.
ja: RAW（大文字・小文字を区別しない）を指定すると、Textに含まれる正確なバイトを、変換せずにそのままファイルに書き込むことができます。

source: Specify zero (0) to move the mouse without clicking; for example, Click "100 200 0".
ja: クリックせずにマウスを動かす場合は、ゼロ（0）を指定します（例：Click "100 200 0"）。

source: Specify zero or more of the following components:
ja: 以下の構成要素のうち、0個以上を指定します。

source: Specify zero or more of the following words or characters.
ja: 次の単語または文字のうち、0個以上を指定します。

source: Specifying -1 indicates the current function, -2 indicates the function which called it, and so on.
ja: 1を指定すると現在の関数、-2を指定するとその関数を呼び出した関数、といった具合です。

source: Specifying -1 turns on Critical but disables message checks.
ja: -1 を指定すると、Critical は有効になりますが、メッセージチェックは無効になります。

source: Specifying 0 is no longer the same as specifying 0.5; instead, it produces the shortest wait possible.
ja: 0を指定しても、0.5を指定したのと同じではなく、最短の待ち時間が発生するようになりました。

source: Specifying 0 turns off Critical.
ja: 0を指定すると、Criticalがオフになります。

source: Specifying L0 disables collection of text and the length limit, but does not affect which keys are counted as producing text (see VisibleText).
ja: L0を指定すると、テキストの収集と長さの制限が無効になりますが、どのキーがテキストを生成しているとカウントされるかは影響しません（「VisibleText」を参照）。

source: Specifying BackgroundDefault or -Background applies the system's default background color.
ja: BackgroundDefaultまたは-Backgroundを指定すると、システムのデフォルトの背景色が適用されます。

source: Specifying - is the same as specifying -rwd.
ja: -を指定することは、-rwdを指定することと同じです。

source: Specifying "Off" is different than specifying 255 because it may improve performance and reduce usage of system resources (but probably only when desktop composition is disabled).
ja: Offを指定すると、パフォーマンスが向上し、システムリソースの使用量が減る可能性があるため、255を指定するのとは異なる（ただし、おそらくデスクトップ合成が無効になっている場合のみ）。

source: Specifying BackgroundDefault or -Background applies the system's default background color (usually white).
ja: BackgroundDefaultまたは-Backgroundを指定すると、システムのデフォルトの背景色（通常は白）が適用されます。

source: Specifying -ReadOnly (or +0x200) allows the user to edit the first field of each row in place.
ja: ReadOnly（または+0x200）を指定すると、ユーザーは各行の最初のフィールドをその場で編集できる。

source: Specifying Off is different than specifying 255 because it may improve performance and reduce usage of system resources (but probably only when desktop composition is disabled).
ja: Offを指定すればパフォーマンスが向上し、システムリソースの使用量が減る可能性があるため、255を指定するのとは異なります。ただし、デスクトップコンポジションが無効になっているときに限られるでしょう。

source: Specifying a higher value for the MaxThreads parameter allows the function to be interrupted to process the newly-received message.
ja: MaxThreadsパラメータに高い値を指定すると、新しく受信したメッセージを処理するために関数を中断させることができます。

source: Specifying a key by name, by {vkNN} or by {scNNN} may produce three different results; see below for details.
ja: キーを名前、{vkNN}、または{scNNN}で指定すると、3つの異なる結果が得られます；詳細は以下を参照してください。

source: Specifying a name for the function allows it to be called recursively or by other nested functions without storing a reference to the closure within itself (thereby creating a problematic circular reference).
ja: 関数の名前を指定することで、クロージャへの参照を自分自身の中に保存することなく（それによって問題のある循環参照を作成する）、再帰的または他のネストされた関数から呼び出すことができます。

source: Specifying a number higher than 255 is the same as specifying 255.
ja: 255より大きい数値を指定しても、255を指定したのと同じになります。

source: Specifying a positive number as the first parameter (e.g. Critical 30) turns on Critical but also changes the minimum number of milliseconds between checks of the internal message queue.
ja: 第1パラメータに正の数を指定すると（例：Critical 30）、Criticalがオンになりますが、内部メッセージキューのチェック間の最小ミリ秒数が変更されます。

source: Specifying a precision may cause the value to be truncated or rounded.
ja: 精度を指定すると、値が切り捨てられたり、丸められたりすることがあります。

source: Specifying an asterisk (*) for Filename causes Text to be sent to standard output (stdout).
ja: Filenameにアスタリスク（*）を指定すると、Textは標準出力（stdout）に送られます。

source: Specifying an asterisk (*) for OutputFile sends any text written by FileAppend to standard output (stdout).
ja: OutputFileにアスタリスク（*）を指定すると、FileAppendで書き込んだテキストを標準出力（stdout）に出力します。

source: Specifying an incorrect length may produce unexpected behaviour.
ja: 正しくない長さを指定すると、予期せぬ動作をすることがある。

source: Specifying an index of 0 is the same as specifying Length + 1.
ja: 0を指定すると、Length+1を指定したのと同じになります。

source: Specifying the number 24 enables whichever type of prompt is supported by the dialog.
ja: 24を指定すると、ダイアログでサポートされているどのタイプのプロンプトも有効になります。

source: Specifying this anywhere in a script will cause built-in functions that activate a window -- such as WinActivate, WinActivateBottom, and GroupActivate -- to skip the "gentle" method of activating a window and go straight to the more forceful methods.
ja: このディレクティブをスクリプトの任意の場所に記述すれば、WinActivate、WinActivateBottom、GroupActivateなどのウィンドウをアクティブにする組み込み関数が、ウィンドウをアクティブにする「優しい」方法をスキップして、より強力な方法を直行するようになります。

source: Specifying this anywhere in a script will prevent the showing of a tray icon for that script when it is launched (even if the script is compiled into an EXE).
ja: スクリプトの任意の場所でこれを指定すると、スクリプトの起動時にトレイアイコンが表示されなくなります（スクリプトがEXEにコンパイルされている場合も同様です）。

source: Specifying two asterisks (**) for Filename causes Text to be sent to the standard error stream (stderr).
ja: Filenameにアスタリスク（**）を2つ指定すると、Textは標準エラーストリーム（stderr）に送信されます。

source: Specifying zero as the last parameter is optional; it initializes all members to be binary zero, which is typically used to avoid calling NumPut as often in the next step.
ja: 最後のパラメータにゼロを指定することはオプションです。これは、すべてのメンバーを2進数のゼロに初期化し、次のステップでNumPutを頻繁に呼び出すのを避けるために通常使用します。

source: SplashImage (use Gui)
ja: SplashImage（Guiを使用）

source: SplashTextOn/Off (use Gui)
ja: SplashTextOn/Off（Guiを使用）

source: Split into separate Volume and Mute functions.
ja: ボリュームとミュートの機能に分割。

source: SplitPath - Syntax & Usage | AutoHotkey v2
ja: SplitPath - 構文と使用法｜AutoHotkey v2

source: SplitPath SourceFolder, &SourceFolderName ; Extract only the folder name from its full path.
ja: SplitPath SourceFolder, &SourceFolderName ; フルパスからフォルダ名のみを抽出します。

source: SplitPath(FileName,,, &FileExt) ; Get the file's extension.
ja: SplitPath(FileName,,, &FileExt) ; ファイルの拡張子を取得します。

source: Splitting a Long Line into a Series of Shorter Ones
ja: 長い線を短い線に分割する

source: Square brackets signify that the enclosed parameters are optional (the brackets themselves should not appear in the actual code).
ja: 角括弧は、囲んだパラメータがオプションであることを示します（括弧自体は実際のコードに表示されるべきではありません）。

source: Stack underflow (typically caused by a syntax error).
ja: スタックアンダーフロー（通常、構文エラーによって引き起こされる）。

source: Standalone Formats
ja: スタンドアロン型フォーマット

source: Standalone use of the operators +=, -=, -- and ++ no longer treats an empty variable as 0.
ja: 演算子+=,-=,--,++を単独で使用しても、空の変数を 0 として扱わなくなりました。

source: Standard Windows Fonts
ja: Windows標準フォント

source: Standard Windows Fonts | AutoHotkey v2
ja: Windows標準フォント｜AutoHotkey v2

source: Start Menu Folder
ja: スタートメニューフォルダ

source: Start or end a line with an expression operator to join it to the previous or next line.
ja: 式演算子で行を開始または終了し、前の行または次の行に連結する。

source: Starting point for the file pointer move.
ja: ファイルポインタの移動の開始点。

source: Starts a new section and saves this control's position for later use with the xs and ys positioning options described above.
ja: 新しいセクションを開始し、このコントロールの位置を保存して、後で上記のxsとys の位置決めオプションで使用できるようにします。

source: Starts collecting input.
ja: 入力の収集を開始します。

source: Starts the user's chosen screen saver.
ja: ユーザーが選択したスクリーンセーバーを起動します。

source: State image 1 is the unchecked box, and state image 2 is the checked box.
ja: 状態イメージ1がチェックされていないボックスで、状態イメージ2がチェックされたボックスである。

source: Statement
ja: 文

source: Static Functions
ja: スタティック関数

source: Static Methods
ja: 静的メソッド

source: Static Variables
ja: スタティック変数

source: Static functions
ja: 静的機能

source: Static methods are defined by preceding the method name with the separate keyword static.
ja: 静的メソッドは、メソッド名の前に個別のキーワードstaticを付けて定義します。

source: Static properties can be defined by preceding the property name with the separate keyword static.
ja: スタティック・プロパティは、プロパティ名の前にstaticという個別のキーワードを付けて定義することができます。

source: Static variables
ja: 静的変数

source: Static variables are always implicitly local, but differ from locals because their values are remembered between calls.
ja: 静的変数は常に暗黙のローカル変数ですが、呼び出しの間にその値が記憶されるため、ローカル変数とは異なります。

source: Static/Class Variables
ja: 静的クラス変数

source: Static/class variable initializers are now executed within the context of a static __Init method, so this refers to the class and the initializers can create local variables.
ja: 静的/クラス変数のイニシャライザーは、static __Initメソッドのコンテキスト内で実行されるようになったので、thisはクラスを参照し、イニシャライザーはローカル変数を作成することができます。

source: Static/class variables belong to the class itself, but their values can be inherited by subclasses.
ja: 静的変数/クラス変数はクラスそのものに属しますが、その値はサブクラスに継承させることができます。

source: Status
ja: ステータス

source: StatusBar Control Styles
ja: StatusBarコントロールのスタイル

source: StatusBarWait - Syntax & Usage | AutoHotkey v2
ja: StatusBarWait - 構文と使用法｜AutoHotkey v2

source: StatusBarWait determines its target window before it begins waiting for a match.
ja: StatusBarWaitは、マッチ待ちを開始する前にターゲット・ウィンドウを決定する。

source: StatusbarGetText - Syntax & Usage | AutoHotkey v2
ja: StatusbarGetText - 構文と使用法｜AutoHotkey v2

source: Stay open:
ja: オープンなままで：

source: Stay open: If enabled, the window will not close automatically after creating a script.
ja: Stay open：有効にすると、スクリプト作成後にウィンドウが自動的に閉じなくなる。

source: Stdout receives the following UTF-8 strings, each terminated with `n:
ja: Stdoutは、`nで終端された以下のUTF-8文字列を受け取る：

source: Step through code line by line - step into, over or out of functions.
ja: コードを一行ずつステップスルー - 関数の中に入ったり、関数の上や外に出たり。

source: Stepping out of a function which was called as a new thread now breaks at the line which was interrupted, instead of waiting until the next line is reached.
ja: 新しいスレッドとして呼び出された関数からのステップアウトするときは、次の行に到達するまで待つのではなく中断された行でブレークするようになりました。

source: Stereo Mix (Example HD Audio)
ja: ステレオ・ミックス（HDオーディオの例）

source: Stop
ja: ストップ

source: Stop after the current track
ja: 現在のトラックで停止

source: Stop further checks.
ja: それ以上のチェックを停止します。

source: Stop media player
ja: メディアプレーヤーの停止

source: Stop with Fadeout
ja: フェードアウト

source: Stores one or more numbers in binary format at the specified address+offset.
ja: 指定されたアドレス＋オフセットに、1つ以上の数値をバイナリ形式で格納します。

source: Stores the control's HWND in OutputVarControl rather than the control's ClassNN.
ja: コントロールのClassNNではなく、コントロールのHWNDを OutputVarControlに格納します。

source: Stores the attribute letters of a directory in OutputVar.
ja: ディレクトリの属性文字をOutputVarに格納します。

source: Storing a number in a variable or returning it from a user-defined function retains its pure numeric status.
ja: 数値を変数に格納したり、ユーザー定義関数から返したりしても、純粋な数値の状態を維持することができます。

source: Storing and Responding to User Input
ja: ユーザー入力の保存と対応

source: StrCompare - Syntax & Usage | AutoHotkey v2
ja: StrCompare - 構文と使用法｜AutoHotkey v2

source: StrGet - Syntax & Usage | AutoHotkey v2
ja: StrGet - 構文と使用法｜AutoHotkey v2

source: StrLen - Syntax & Usage | AutoHotkey v2
ja: StrLen - 構文と使用法｜AutoHotkey v2

source: StrLower / StrUpper / StrTitle - Syntax & Usage | AutoHotkey v2
ja: StrLower / StrUpper / StrTitle - 構文と使用法｜AutoHotkey v2

source: StrPtr - Syntax & Usage | AutoHotkey v2
ja: StrPtr - 構文と使用法｜AutoHotkey v2

source: StrPut - Syntax & Usage | AutoHotkey v2
ja: StrPut - 構文と使用法｜AutoHotkey v2

source: StrPut may be called once to calculate the required buffer size for a string in a particular encoding, then again to encode and write the string into the buffer.
ja: StrPutは、特定のエンコーディングの文字列に必要なバッファサイズを計算するために一度呼び出され、その後、文字列をエンコードしてバッファに書き込むために再度呼び出されることがある。

source: StrPut's return value is now in bytes, so it can be passed directly to Buffer().
ja: StrPutの戻り値がバイト単位になったので、Buffer()に直接渡すことができます。

source: StrReplace - Syntax & Usage | AutoHotkey v2
ja: StrReplace - 構文と使用法｜AutoHotkey v2

source: StrSplit - Syntax & Usage | AutoHotkey v2
ja: StrSplit - 構文と使用法｜AutoHotkey v2

source: Strictly speaking, this is necessary only for return values and asterisk variables because it does not matter whether an argument passed by value is unsigned or signed (except for Int64).
ja: 厳密には、valueで渡される引数がunsignedかsignedかは関係ないので、戻り値やアスタリスク変数にのみ必要です（Int64を除く）。

source: String - Syntax & Usage | AutoHotkey v2
ja: String - 構文と使用法｜AutoHotkey v2

source: String Encoding
ja: 文字列のエンコード

source: String and Number extend Primitive.
ja: 文字列とNumberはPrimitiveを継承しています。

source: String keys are case-sensitive by default and are never converted to Integer.
ja: 文字列のキーはデフォルトで大文字と小文字が区別され、Integerに変換されることはありません。

source: String length is now cached during expression evaluation.
ja: 式の評価時に、文字列の長さがキャッシュされるようになりました。

source: String parameters must be passed by address.
ja: 文字列パラメータは、アドレスで渡す必要があります。

source: String, Integer, Float, or the specific class of an object.
ja: String、Integer、Float、またはオブジェクトの特定のクラス。

source: StringCaseSense (use various parameters)
ja: StringCaseSense（各種パラメータを使用）

source: StringCaseSense was removed, so != is always case-insensitive (but !== was added for case-sensitive not-equal), and both = and != only ignore case for ASCII characters.
ja: StringCaseSenseが削除されたため、!=は常に大文字小文字を区別せず（ただし!==は大文字小文字を区別しない非等号のために追加）、=も !=もASCII文字に対してのみ大文字を無視します。

source: StringGetPos (use InStr)
ja: StringGetPos（InStrを使用）

source: StringLower → StrLower and StrTitle
ja: StringLower → StrLower および StrTitle

source: StringReplace (use StrReplace instead)
ja: StringReplace（代わりにStrReplaceを使用します）

source: StringSplit (use StrSplit instead)
ja: StringSplit（代わりにStrSplitを使用します）

source: StringTrimRight -- use SubStr in place of these commands.
ja: StringTrimRight -- これらのコマンドの代わりにSubStrを使用します。

source: StringUpper → StrUpper and StrTitle
ja: StringUpper → StrUpper および StrTitle

source: Strings
ja: 文字列

source: Strings / Text
ja: 文字列 / テキスト

source: Strings that do not start with a number are considered to be zero for the purpose of the sort.
ja: 数字で始まらない文字列は、ソートの目的上ゼロとみなされます。

source: Strings which are passed directly to or from DllCall can be converted to ANSI or UTF-16 by using the AStr or WStr parameter types.
ja: DllCallに直接渡される文字列やDllCallから渡される文字列は、AStrまたはWStrパラメータ型を使用してANSIまたはUTF-16に変換することができます。

source: Structure example.
ja: 構造例です。

source: Structure of a Script
ja: スクリプトの構成

source: Structures and Arrays
ja: 構造体・配列

source: Studies the pattern to try improve its performance.
ja: パターンを研究し、その性能を向上させようとする。

source: Style and Naming Conventions
ja: スタイルと命名規則

source: Styles Common to Gui/Parent Windows and Most Control Types
ja: GUI/親ウィンドウとほとんどのコントロールタイプに共通するスタイル

source: Sub-commands of Control, ControlGet, Drive, DriveGet, WinGet, WinSet and Process have been replaced with individual functions, and the main commands have been removed.
ja: Control、ControlGet、Drive、DriveGet、WinGet、WinSet、Processのサブコマンドは個別の機能に置き換えられ、メインコマンドは削除されました。

source: Sub-expressions can also be concatenated.
ja: 部分式は連結することもできる。

source: Sub-expressions can be combined with strings in the same way.
ja: 部分式も同じように文字列と組み合わせることができます。

source: SubStr - Syntax & Usage | AutoHotkey v2
ja: SubStr - 構文と使用法｜AutoHotkey v2

source: Subclasses could inherit NestedClass or override it with their own nested class (in which case (WhichClass.NestedClass)() could be used to instantiate whichever class is appropriate).
ja: サブクラスは、NestedClassを継承するか、独自のネスト・クラスでオーバーライドすることができます（この場合、(WhichClass.NestedClass)()を使用して、適切なクラスをインスタンス化できます）。

source: Subclasses could inherit NestedClass or override it with their own nested class (in which case WhichClass.NestedClass() could be used to instantiate whichever class is appropriate).
ja: サブクラスは、NestedClassを継承するか、独自のネスト・クラスでオーバーライドすることができます（この場合、WhichClass.NestedClass()を使用して、適切なクラスをインスタンス化できます）。

source: Subroutines
ja: サブルーチン

source: Subsequent calls ignore the Options parameter.
ja: それ以降の呼び出しでは、Optionsパラメータは無視されます。

source: Subsequent values are inserted at Index+1, Index+2, etc.
ja: それ以降の値は、Index+1、Index+2 などに挿入されます。

source: Subsequently-created hotkeys will only execute if calling the given function object yields a non-zero number.
ja: それ以降に作成されたホットキーは、与えられた関数オブジェクトを呼び出すと0以外の数値が得られる場合のみ実行されます。

source: Substrings are matched in the file's description, with the exception of "UIA", which matches if the filename contains "_UIA".
ja: ただし、「UIA」は例外で、ファイル名に「_UIA」が含まれる場合にマッチする。

source: Subunits which apply to multiple Connectors are excluded - such as Subunits which correspond to the master volume and mute controls.
ja: マスターボリュームやミュートコントロールに対応するサブユニットなど、複数のコネクターに適用されるサブユニットは除外されます。

source: Such a delay would otherwise happen if a hotkey is pressed at the exact moment a timer thread is in its period of uninterruptibility:
ja: このような遅延は、タイマースレッドが中断しない期間にある瞬間にホットキーが押された場合に発生します：

source: Such a keystroke can then be defined as a hotkey in a script.
ja: このようなキーストロークは、スクリプトのホットキーとして定義することができます。

source: Such a tooltip is automatically destroyed when its owner is destroyed.
ja: このようなツールチップは、そのオーナーが破壊されると自動的に破壊される。

source: Such additions and changes are not seen by the rest of the system.
ja: このような追加や変更は、システムの他の部分からは見えません。

source: Such code is often used to configure settings which apply to every newly launched thread, or to initialize global variables used by hotkeys and other functions.
ja: このようなコードは、新しく起動したスレッドに適用される設定や、ホットキーやその他の機能で使用するグローバル変数の初期化などによく使用されます。

source: Such comments (along with any spaces and tabs to their left) are entirely omitted from the joined result rather than being treated as literal text.
ja: そのようなコメントは（その左にあるスペースやタブとともに）、リテラルテキストとして扱われるのではなく、結合結果から完全に省略される。

source: Such dialogs are modal, meaning that the user cannot interact with the GUI window until dismissing the dialog.
ja: このようなダイアログはモーダルであり、ユーザーはダイアログを閉じるまでGUIウィンドウと対話することができません。

source: Such expressions might become invalid in the future due to enhanced error-checking.
ja: 将来、エラーチェックの強化により、このような表現が無効となる可能性があります。

source: Such files are automatically converted to their filenames (with full path) whenever the clipboard variable is referred to in the script.
ja: このようなファイルは、スクリプト内でクリップボード変数が参照されるたびに、自動的にそのファイル名（フルパス付き）に変換されます。

source: Such functions usually have no name as they are passed directly to another function.
ja: このような関数は、他の関数に直接渡されるため、通常は名前を持ちません。

source: Such functions, or "event-handlers," have the following structure:
ja: このような関数（「イベントハンドラ」）は、次のような構造を持っています：

source: Such hotkeys perform a different action (or none at all) depending on any condition (an expression).
ja: このようなホットキーは、任意の条件（式）に応じて異なるアクションを実行します（または全く実行されません）。

source: Such hotstrings send a different replacement, perform a different action, or do nothing at all depending on any condition, such as the type of window that is active.
ja: このようなホットストリングは、アクティブなウィンドウの種類などの条件によって、異なる置換を送信したり、異なるアクションを実行したり、まったく何もしなかったりします。

source: Such names may consist of up to 32 alphanumeric characters and underscores.
ja: このような名前は、最大32文字の英数字とアンダースコアで構成されます。

source: Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns.
ja: そのような新バージョンは、現在のバージョンと精神的には類似しているが、新たな問題や懸念に対処するために細部が異なる可能性がある。

source: Such statements are executed in order from left to right.
ja: このようなステートメントは、左から右の順に実行される。

source: Such text can be redirected to a file, piped to another EXE, or captured by fancy text editors.
ja: このようなテキストは、ファイルにリダイレクトしたり、別のEXEにパイプしたり、おしゃれなテキストエディターでキャプチャしたりすることができます。

source: Such warnings are a very effective way to detect errors, so disabling them is not recommended.
ja: このような警告は、エラーを検出するための非常に有効な手段であるため、無効にすることは推奨されません。

source: Such windows are hidden from view, but might still have the WS_VISIBLE window style.
ja: このようなウィンドウは視界から隠れますが、WS_VISIBLEウィンドウのスタイルが残っている可能性があります。

source: Such windows can be used as data entry forms or custom user interfaces.
ja: このようなウィンドウは、データ入力フォームやカスタムユーザーインターフェイスとして使用することができます。

source: Such windows respond to each keystroke and mouse click as though you had performed it manually, which allows repetitive tasks to be automated with high speed and reliability.
ja: このようなウィンドウは、キーストロークやマウスクリックのひとつひとつに、あたかも手動で行ったかのように反応するため、反復作業を高速かつ確実に自動化することができる。

source: Sunday is 1.
ja: 日曜日が1です。

source: Support a single digit for the version.
ja: バージョンは1桁をサポート。

source: Support omitting the "v" prefix.
ja: 接頭辞「v」の省略をサポートしました。

source: Support operators (> >= < <= =).
ja: 演算子として> >= < <= =をサポートしました。

source: Support varies between editors, but the most important features are (in my opinion):
ja: サポート内容はエディターによって異なりますが、最も重要な機能は（私見）です：

source: Supported image formats include ANI, BMP, CUR, EMF, Exif, GIF, ICO, JPG, PNG, TIF, and WMF (BMP images must be 16-bit or higher).
ja: 対応する画像形式は、ANI、BMP、CUR、EMF、Exif、GIF、ICO、JPG、PNG、TIF、WMF（BMP画像は16ビット以上）です。

source: Supported image formats include ANI, BMP, CUR, EMF, Exif, GIF, ICO, JPG, PNG, TIF, and WMF.
ja: 対応する画像形式は、ANI、BMP、CUR、EMF、Exif、GIF、ICO、JPG、PNG、TIF、WMFです。

source: Supported values are described in the tables below.
ja: サポートされる値は、以下の表のとおりです。

source: Suppress errors when checking whether an absent version can be downloaded.
ja: 不在のバージョンがダウンロード可能かどうかをチェックする際のエラーを抑制しました。

source: Suppress the default error dialog and any remaining error callbacks.
ja: デフォルトのエラーダイアログと残りのエラーコールバックを抑制します。

source: Suppresses (blocks) the key after processing it.
ja: キーを処理した後、サプレス（ブロック）します。

source: Suspend - Syntax & Usage | AutoHotkey v2
ja: Suspend - 構文と使用法｜AutoHotkey v2

source: Suspend Hotkeys - Suspend or unsuspend hotkeys.
ja: Suspend Hotkeys（ホットキーのサスペンド） - ホットキーをサスペンドまたはサスペンド解除します。

source: Suspending a script's hotkeys does not stop the script's already-running threads (if any); use Pause to do that.
ja: スクリプトのホットキーを一時停止しても、スクリプトの実行中のスレッド（もしあれば）は停止しません。その場合はPauseを使用してください。

source: Suspends all hotkeys and hotstrings except those explained the Remarks section.
ja: Remarks セクションで説明した以外のすべてのホットキーと ホットストリングを一時停止します。

source: Switch - Syntax & Usage | AutoHotkey v2
ja: Switch - 構文と使用法｜AutoHotkey v2

source: Switches the active window's keyboard layout/language to English (US).
ja: アクティブウィンドウのキーボードレイアウト/言語を英語（US）に切り替えます。

source: Switches to the SendEvent method for Send, SendText, Click, and MouseMove/Click/Drag.
ja: 送信、テキスト送信、クリック、マウス移動/クリック/ドラッグで、SendEventメソッドへ切り替わります。

source: Switches to the SendPlay method for Send, SendText, Click, and MouseMove/Click/Drag.
ja: 送信、テキスト送信、クリック、マウス移動/クリック/ドラッグのメソッドをSendPlayへ切り替えます。

source: Symbols
ja: 記号

source: Synonymous with A_MDay.
ja: A_MDayと同義。

source: Synonymous with A_Mon.
ja: A_Monと同義。

source: Synonymous with A_Year.
ja: A_Yearと同義。

source: Synonymous with SM_CXFRAME and SM_CYFRAME.
ja: SM_CXFRAME および SM_CYFRAME と同義。

source: Syntax
ja: 構文

source: Syntax Errors
ja: シンタックスエラー

source: Syntax and Usage
ja: 構文と使用法

source: Syntax highlighted, read-only view of the source code.
ja: シンタックスハイライトされた、ソースコードの読み取り専用ビューです。

source: Syntax highlighting
ja: 構文のハイライト

source: Syntax highlighting to make the code easier to read (and write).
ja: コードを読みやすく（書きやすく）するためのシンタックスハイライト。

source: Syntax highlighting, if configured by the user.
ja: ユーザーによって設定されている場合、シンタックスハイライトを行います。

source: Syntax highlighting, like what is used in this documentation.
ja: このドキュメントで使われているような構文の強調表示。

source: Syntax:
ja: 構文：

source: SysGet - Syntax & Usage | AutoHotkey v2
ja: SysGet - 構文と使用法｜AutoHotkey v2

source: SysGet simply calls the GetSystemMetrics function, which may support more system properties than are documented here.
ja: SysGetは単にGetSystemMetrics関数を呼び出すだけであり、ここで文書化されているよりも多くのシステム・プロパティをサポートしている可能性がある。

source: SysGetIPAddresses - Syntax & Usage | AutoHotkey v2
ja: SysGetIPAddresses - 構文と使用法｜AutoHotkey v2

source: System Menu
ja: システム メニュー

source: System Modal (always on top)
ja: システムモーダル（常に上部に表示される）

source: System Verbs
ja: システム動詞

source: System verbs correspond to actions available in a file's right-click menu in the Explorer.
ja: システム動詞は、エクスプローラーのファイルの右クリックメニューで利用できるアクションに対応しています。

source: System-generated.
ja: システムが生成する。
